                   //Толга Хасан Хатиб - ФПМИ,фак.номер:181217018
             //Курсова работа по Информатика 2 - синтез и анализ на алгоритми

/*зад.3 - Зададен е масив X[1..N] с N реални измервания. Напишете процедура,
 която запълва масив A[1..N] с текущите средни (prefix average) и която
 работи с линейна сложност.(Текущите средни намират приложение във финансовия анализ)*/

using System;
namespace CourseProjectFPMI
{
    class Exercise3
    {
        static void Main()
        {
            Console.Write("Input array length: ");
            int n = int.Parse(Console.ReadLine()); //Въвеждане дължината на масива от потребителя
            decimal[] X = new decimal[n]; //Създаване на масив X,в който ще бъдат записани произволни елементи
            decimal[] A = new decimal[n]; //Създаване на масив А, в който ще бъдат записани текущите средни 
            decimal sum = 0; //Създаване на променлива "sum"(от тип decimal),с цел да се записва сумата на елементите при всяка итерация
            Random r = new Random(); //Създаване на клас "r"(Random),която ще послужи за запълването на масив X с произволни числа

            for (int i = 0; i < n; i++)   //for цикъл,с който се обхожда масива
            {
                X[i] = r.Next(1, 10);   //При всяка една итерация всеки следващ елемент от масива X се запълва с произволно(неотрицателно) число(тип integer),което се намира в диапазона между 1 и 10.
                sum += X[i]; //При всяка следваща итерация към стойността на променливата sum се прибавя стойността на поредния елемент от масив X.
                A[i] = sum / (i+1); //При всякйа една итерация всеки следващ елемент от масива A се запълва с текущата й средна,която се изчислява по зададената формула.
            }
            Console.Write("Elements: "); 
            Console.WriteLine(String.Join(" ", X)); //Извежда елементите от масив X в конзолата(с разделител интервал)
            Console.Write("Prefix Averages: ");
            Console.WriteLine(String.Join(" ", A)); //Извежда елементите от масив A в конзолата(с разделител интервал)
            Console.ReadKey(); //След натискане на произволен клавиш конзолата се затваря,което означава край на програмата.

            /*ЗАБЕЛЕЖКА: Елементите в първия масив се запълват от произволни
             числа(тип integer) с цел да се покаже приципа на действие на процедурата.
             Също така r.Next е с малък диапазон,за да може читателят/изпълнителят на
             тази програма да провери(на ръка) дали тя е реализирана првалино логически:)*/
        }
    }
}
